{"value": {"meta": {"title": "North Korean infiltrator caught working in Amazon IT department thanks to lag — 110ms keystroke input raises red flags over true location", "subreddit": "technology", "score": 14401, "num_comments": 631, "author": "Squeezer999", "created_utc": 1766084909.0, "created_time": "6 giờ trước", "url": "https://www.reddit.com/r/technology/comments/1ppz942/north_korean_infiltrator_caught_working_in_amazon/", "selftext": "", "upvote_ratio": 0.97, "id": "1ppz942"}, "comments": [{"body": "This also confirms they're using keyboard monitoring software - so kind of a good and bad story.", "author": "MikeTalonNYC", "score": 5900, "created_utc": 1766085556.0, "id": "nuqen24"}, {"body": "How can the keystroke and the input be detected as delayed? The difference on camera vs the actual key entered? Because if he’s working remotely the PC will detect the stroke when it detects it so how would software capture that?", "author": "DrixlRey", "score": 449, "created_utc": 1766089179.0, "id": "nuqqqlw"}, {"body": "How the hell did they get that far in the hiring process if it’s a US based position ?\n\nDid they have someone show up with a fake passport, I9 and work permit or is Amazon just verifying this stuff online ?", "author": "celtic1888", "score": 898, "created_utc": 1766085937.0, "id": "nuqfxi8"}, {"body": "&gt; Amazon reckoning it is seeing a 27% QoQ uplift in North Koreans trying to get into the Amazon corporation.\n\nFunny to see this stated this way. I'm used to seeing \"27% QoQ uplift in revenue in whatever division\".", "author": "rnilf", "score": 199, "created_utc": 1766087014.0, "id": "nuqjiqu"}, {"body": "110ms of lag occurred between what two events? I read the article and I still can’t puzzle it out.", "author": "Richard-Brecky", "score": 84, "created_utc": 1766090858.0, "id": "nuqw7vs"}, {"body": "What tool were they using to capture the latency of the keyboard?", "author": "Digitaalbeekeper", "score": 108, "created_utc": 1766088046.0, "id": "nuqn07p"}, {"body": "I knew of six or so people at a big tech company that were not working from where they were listed. I taught them stuff, wrote them AI models, worked there longer than they did and was moved internally under them. Then the exexs above ended up laying me off, since those people were my middle management, and I wasn't part of their shady clique.\n\nE.g. one guy claimed to be in Poland, actually he lived outside a van in Oregon using starlink.\n\nNot sure why I'm sharing this other than to say, this  is guaranteed to be happening, all of the time.", "author": "Leather_Secretary_13", "score": 35, "created_utc": 1766089404.0, "id": "nuqrh2s"}, {"body": "Can someone explain how this works? How would they be able to tell when the key is physically pushed?\n\nAlso if it was being remote controlled from NK, wouldn’t whatever software be flagged in the Amazon laptop?", "author": "Hazeejay", "score": 12, "created_utc": 1766090125.0, "id": "nuqttts"}, {"body": "They probably put him on a PiP.  Any more keyboard lag and he’s fired for sure.", "author": "aaaaaiiiiieeeee", "score": 10, "created_utc": 1766094125.0, "id": "nur73ue"}, {"body": "110ms is what I get playing WoW from south America", "author": "Jristz", "score": 36, "created_utc": 1766086861.0, "id": "nuqj043"}, {"body": "companies are going to start using this as an excuse to more aggressively bring people back into the office.\n\n\"well if we can't see you in person, how do we know you're not a foreign threat actor?\"", "author": "ExitMusic_", "score": 9, "created_utc": 1766090384.0, "id": "nuqunn6"}, {"body": "Note to North Korea:  make sure keystroke lag time &lt; 15 ms", "author": "WeakMindedHuman", "score": 6, "created_utc": 1766089238.0, "id": "nuqqxfb"}, {"body": "Y'all remember that single dot that was active in NK on Steam and disappeared but then came back online? I remember that. Fun times. ", "author": "SHODAN117", "score": 7, "created_utc": 1766093367.0, "id": "nur4kun"}, {"body": "How can North Koreans get a job at amazon but I can’t bruh. Graduate next semester", "author": "Okidoki101011", "score": 8, "created_utc": 1766102197.0, "id": "nurvedb"}, {"body": "I think this article is nonsense and if the security staff in Amazon really said this then it’s even more nonsense.\n\nThe 110ms keystroke measured between what and what? If the laptop is controlled remotely? I can’t wrap my head around this stupid statement", "author": "Zweckbestimmung", "score": 18, "created_utc": 1766089019.0, "id": "nuqq7ja"}, {"body": "Cool that they got caught, but crazy that Amazon monitors for keystroke latency", "author": "dynamiteSkunkApe", "score": 6, "created_utc": 1766092952.0, "id": "nur36e7"}, {"body": "they should have asked him: “how fat is Kim Jong Un?” during the interview. He probably wouldn’t have answered.  I didn’t make this up, one of the Crowdstrike people used this question to weed them out", "author": "browndog03", "score": 6, "created_utc": 1766103156.0, "id": "nury3n3"}, {"body": "Yeah, they're still at 56k in North Korea, got caught immediately 😝", "author": "agfacid1", "score": 29, "created_utc": 1766085150.0, "id": "nuqda0g"}, {"body": "bro koreans cant escape getting flamed for ping anywhere", "author": "AlongForZheRide", "score": 4, "created_utc": 1766100446.0, "id": "nurqi5d"}, {"body": "I'm telling you, when this administration took over, our national security developed a hole the size of the USS Cole's.  We are likely permanently compromised, by the countries who thought to take advantage.", "author": "DemonCipher13", "score": 8, "created_utc": 1766098181.0, "id": "nurjxpy"}, {"body": "I don’t think they only “routered” the traffic. The correct term is “routed”.\n\nIf the traffic is only routed through that pc in Arizona then it’s easier to find out the source of packets on that Arizona pc than to measure the latency. I think with an operation of such scale the North Korean government would be more careful.\n\nAdditionally, does their software measure the stroke timestamp at the origin? In North Korea? This isn’t a monitoring software, this is quantum hacking software lol! \n\nTrust me this is a bogus article", "author": "Zweckbestimmung", "score": 3, "created_utc": 1766090748.0, "id": "nuqvuod"}, {"body": "Damn 110ms from NK? Better than I used to get to EU Blizzard servers lol.", "author": "dBlock845", "score": 3, "created_utc": 1766097221.0, "id": "nurgzxc"}, {"body": "I was “interviewed” by them through linkedin. They claimed they have a part time software developer position but my only job was to be an “interviewer”. They will send me a laptop and they will remote to it and take care of the rest. \n\nThey claimed from Japan but when I asked where they are  base  in Japanese they didn’t seem to understand. \n\n\nI took picture of the guy but I can’t post it here. The name of the company is WWCorporate.", "author": "dacs07", "score": 3, "created_utc": 1766098791.0, "id": "nurlr4y"}, {"body": "1. SSH to a US server.\n2. Type \"sudo apt update\".\n3. Wait more than 110ms for each letter to appear as you typing.\n4. Oh fucked I'm exposed !", "author": "Beneficial_Common683", "score": 3, "created_utc": 1766099965.0, "id": "nurp52q"}, {"body": "CrowdStrike call this threat actor ‘Famous Chollima.’ If interested, google it. Really interesting and widespread.", "author": "NapierNoyes", "score": 3, "created_utc": 1766103117.0, "id": "nurxzlf"}, {"body": "Lag between what?\n\n\nNot like its possible to measure lag between keypress and characters appearing on screen. ", "author": "Puzzleheaded_Bus7706", "score": 15, "created_utc": 1766089264.0, "id": "nuqr0ic"}, {"body": "I remember a time at my last company where a particular piece of software logged every keystroke to a plaintext file. Because that's never a bad idea. /s", "author": "FunkyUptownCobraKing", "score": 5, "created_utc": 1766087422.0, "id": "nuqkwej"}, {"body": "Amazon = spy this is will sit very well globally", "author": "Dsrtfsh", "score": 2, "created_utc": 1766087799.0, "id": "nuqm68b"}]}, "expires_at": 1766110822.9236298, "created_at": 1766109022.9236317}